//Створити клас Product (назва, ціна, тип (для цього можете створити енум) і ще 1-3 поля за власним бажанням).
// Приватні поля, гетери-сетери, констркутор, туСтрінг, equals&hashcode.
//        Створити клас Store, який матиме поле - List продуктів. Конструктор класу store не має жодних параметрів,
//        в тілі просто ініціалізує List (new ArrayList<>).
//        В класі Store створити, і в мейні викликати, наступні методи:
//        1. Додати продукт в магазин. Але перш ніж додати його в ліст,
//        здійснити валідацію (чи ціна не від'ємна, чи в назві товару не присутні цифри).
//        2. Видалити продукт з магазину по назві.
//        3. Збільшити ціну для вказаного у параметрі типу продуктів удвічі
//        4. Усі товари, дорожчі вказаної суми, записати у окремий ліст і вивести його на екран
//        (наприклад "В нашому магазині продаються такі преміум товари:...)
//        5. Порахувати загальну суму усіх товарів вказаного у вхідному параметрі типу і вивести її на екран
//        6. Порахувати середню вартість усіх товарів в магазині і вивести це число на екран
//
//        Для роботи з колекцією варто ще створити метод, який наповнить наш магазин одразу же ж певною кількістю продуктів

package lesson5;


public class Main {
    public static void main(String[] args) {


        Store store = new Store();
        //        1. Додати продукт в магазин. Але перш ніж додати його в ліст,
//        здійснити валідацію (чи ціна не від'ємна, чи в назві товару не присутні цифри).
        store.addProduct(new Product("bred", 10.0, ProductType.Products, "29.11.2020"));
        store.addProduct(new Product("milk", 18.0, ProductType.Products, "20.11.2020"));
        store.addProduct(new Product("oil", 10.0, ProductType.Products, "10.05.2020"));
        store.addProduct(new Product("boots", 1500.0, ProductType.Shoes, "25.11.2019"));
        store.addProduct(new Product("dress", 1000.0, ProductType.Clothing, "20.07.2020"));
        System.out.println(store);
//        2. Видалити продукт з магазину по назві.
        store.removeProduct("oil");
//        3. Збільшити ціну для вказаного у параметрі типу продуктів удвічі
        store.doublingPrice(ProductType.Shoes);
//        4. Усі товари, дорожчі вказаної суми, записати у окремий ліст і вивести його на екран
//        (наприклад "В нашому магазині продаються такі преміум товари:...)
        System.out.println("у нашому магазині продаються такі преміум товари:  " + store.premiumProduct(1000.0));
//        5. Порахувати загальну суму усіх товарів вказаного у вхідному параметрі типу і вивести її на екран
        store.sumProductType(ProductType.Products);
//        6. Порахувати середню вартість усіх товарів в магазині і вивести це число на екран
        store.averageSumProduct();
//        Для роботи з колекцією варто ще створити метод, який наповнить наш магазин одразу же ж певною кількістю продуктів
      //  store.addCertianAmountProducts(2);


    }
}
